In [6]:
import pandas as pd

In [10]:
dataset=pd.read_csv(r'I://Text Datasets//CSV//titanic.csv')
dataset.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [104]:
pd.get_option('display.max_columns')

20

In [105]:
pd.get_option('display.max_rows')

10

In [106]:
pd.set_option('display.max_rows',None)

In [107]:
pd.set_option('display.max_rows',10)

In [108]:
pd.set_option('display.max_colwidth',100000)

In [109]:
pd.set_option('display.precision',6)

In [112]:
dataset['X']=dataset.Fare*10000
dataset['Y']=dataset.Age*10000

In [114]:
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,X,Y
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,"72,500.0","220,000.0"
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C,"712,833.0","380,000.0"
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S,"79,250.0","260,000.0"
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1,C123,S,"531,000.0","350,000.0"
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.05,NaN,S,"80,500.0","350,000.0"

In [124]:
pd.set_option('display.float_format','{:,}'.format)

In [125]:
dataset['X'].describe(include='object')

count                 891.0
mean    322,042.07968574634
std       496,934.285971809
min                     0.0
25%                79,104.0
50%               144,542.0
75%               310,000.0
max             5,123,292.0
Name: X, dtype: float64

In [133]:
pd.describe_option('columns')

display.max_columns : int
    If max_cols is exceeded, switch to truncate view. Depending on
    `large_repr`, objects are either centrally truncated or printed as
    a summary view. 'None' value means unlimited.

    In case python/IPython is running in a terminal and `large_repr`
    equals 'truncate' this can be set to 0 and pandas will auto-detect
    the width of the terminal and print a truncated object which fits
    the screen width. The IPython notebook, IPython qtconsole, or IDLE
    do not run in a terminal and hence it is not possible to do
    correct auto-detection.
    [default: 20] [currently: 20]display.max_info_columns : int
    max_info_columns is used in DataFrame.info method to decide if
    per column information will be printed.
    [default: 100] [currently: 100]

In [134]:
pd.reset_option('all')

: boolean
    use_inf_as_null had been deprecated and will be removed in a future
    version. Use `use_inf_as_na` instead.

C:\Users\Hamza\AppData\Local\Continuum\anaconda3\envs\cool\lib\site-packages\pandas\_config\config.py:622: FutureWarning:
: boolean
    use_inf_as_null had been deprecated and will be removed in a future
    version. Use `use_inf_as_na` instead.

  warnings.warn(d.msg, FutureWarning)